---
kind: other
id: Methods.T:Autodesk.Revit.DB.Analysis.VectorAtPoint
source: html/1075be9f-03b9-93b0-0b7e-36b268c3c839.htm
---
# VectorAtPoint Methods

Sets flags for all measurements to ValueAtPointFlags::None.